{
    "Unreleased": [
        "Resolves some issues around musiclayer commands.",
        "Converts the 'puzzle' console command to a custom statement."
    ],
    "v2.0.0-4c3ea90": [
        "Replaces the OcellusScript language option with Swift and updates chapters using this language option.",
        "Resolves an issue where some lines didn't respect the user's preference for pronoun usage.",
        "Resolves an asset issue where the old splash screen would be displayed instead of the new one.",
        "Updates several portions of the story with clarifications to resolve inconsistencies and ambiguities.",
        "Updates the rollback settings UI to a more accurate description with visual aids.",
        "Removes old settings in place from the minigame classic mode.",
        "Introduces framework for an adaptive music system built with layers.",
        "Adds some content for Chapter 11: Encouragement.",
        "Adds CG content for Chapters 4, 7, 9, and 10."
    ],
    "v2.0.0-ed4c706": [
        "Adds failsafes to re-enable the quick menu and skipping abilities when the minigame crashes, quits, or when loading a save.",
        "Adds new methods test_input and test_next to run NadiaVM commands in a new instance for testing.",
        "Resolves collision check failures on minigame levels that don't disable collisions.",
        "Updates main menu music to the finalized version.",
        "Resolves an issue where players can accidentally roll back to the name selection screen.",
        "Resolves some minigame issues by removing one sandbox layer.",
        "Resolves an issue where running poweron on the same device twice caused unconditional increments and incorrect state creation.",
        "Resolves an issue where the player's inventory persisted during loading to past or future load files.",
        "Updates splash screen to new \"Created by Marquis Kurt\" branding."
    ],
    "v2.0.0-521b2d5": [
        "Adds new levels to the minigame experience.",
        "Updates Discord images and save chapter icons.",
        "Resolves an issue where lvl may not be defined in Advanced Mode.",
        "Resolve an issue where Steam libraries were missing the Steampipe builds.",
        "Makes some general revisions to the story for clarity.",
        "Resolves an issue in Chapter 3 where Christina would temporarily go faceless.",
        "Resolves an issue where players would not leave after quitting the game while in a minigame.",
        "Resolves an issue where use_item would crash during rollbacks.",
        "Changes Chapter 5's chess piece bit to require inventory interactivity.",
        "Changes Meredith's introduction and Christina's appearance in Chapter 6.",
        "Resolves an issue in Chapter 10 where the player couldn't continue because the USB stick wasn't in the inventory.",
        "Resolves an issue in Chapter 10 where Katorin mentions \"_m1_script0x2dch8__chunk\" instead of level.",
        "Mitigates an issue where the \"What's New\" screen may continuously pop up, even if the player has seen it.",
        "Adds a brand-new version of the main menu theme.",
        "Adds a \"prefers dynamic background\" option in Settings > Appearance to toggle the dynamic background on the main menu.",
        "Adds a new experiment \"puzzles-app\" where players can run any minigame puzzles from AliceOS."
    ],
    "v2.0.0-775c614": [
        "Adds changelog parsing capabilities with simplechanges package.",
        "Includes a new \"What's New\" screen when launching on new updates.",
        "Introduces language parsing capabilities to NadiaVM.",
        "Adds support for comments to NadiaVM with a preceding semicolon (; comment).",
        "Changes set command in NadiaVM to allow either a constant or to change a casted value.",
        "Resolves an issue where the background after the credits used the old artwork.",
        "Updates Fira API to v2.0.0-beta1 and removes deprecated functions.",
        "Adds migration information to the API documentation for older versions.",
        "Updates the documentation template to use syntax highlighting with the Ayu color scheme.",
        "Removes transitional property \"str_checks\" from CSWorldConfigReader.",
        "Deprecates \"allowed_blocks\" property in world configurations and \"allowed\" in CSWorldConfigReader.",
        "Refreshes changelog and developer changelog to use Simple Changes format, loosely structered from Keep a Changelog.",
        "Graduates 'include-nadia-repl', 'opt-in-quickmail', and 'enable-glossary' features.",
        "Adds close method to MinigameLevel class for support in non-context manager cases.",
        "Replaces all instances of old domain with the new domain (unscriptedvn.dev).",
        "Creates a symlink to Application Support in macOS (~/Library/Application Support/Unscripted).",
        "Binds screenshot function to F12 key in addition to S, making it accessible during screens.",
        "Deprecates mg-classic-mode argument and removes basic mode compilation support.",
        "Introduces new theme music written by Marek Domagala as part of the new music set.",
        "Adds a new use-classic-music argument that switches to the old theme music.",
        "Adds a new \"Contributors\" page in the Help menu with all Ko-fi and GitHub Sponsors contributors.",
        "Updates docs for get_feather_icon.",
        "Removes 'game_type' from the StoryMap object.",
        "Cleans up and partially optimizes source code in several core files."
    ],
    "v2.0.0-5a6a4b1": [
        "Resolves an issue where a non-existent story choice (\"shell:zenno_confrontation\") crashed the game.",
        "Resolves an issue where the game crashed due to the minigame's checks not being initialized properly.",
        "Introduces a new state manager that manages minigame level states in interactive and compiled modes.",
        "Updates build configurations to properly relocate files and new build method (patches).",
        "Adds new intentional \"bugs\" such as missing collisions, random exits, and missing bindings, as game mechanics.",
        "Changes macOS icons to better reflect the Big Sur style (and to keep up with theme).",
        "Adds a new console option \"puzzle <int>\" to make debugging puzzles faster.",
        "Implements casting abilities in NadiaVM.",
        "Auto-casts cardinal directions to relative direction (north -> up) in the interactive mode.",
        "Updates interactive scene by privatizing variables.",
        "Adds a new \"patches\" build option which includes only the archives, useful for patching versions.",
        "Updates builds scripts to add Steam support.",
        "Updates glitch effect with colors instead of a black-and-white image.",
        "Resolves an issue where running \"last\" on a CSGrid object resulted in returning the first item.",
        "Adds \"with\" context manager support in CSNadiaVMWriter and CSNadiaVMWriterBuilder.",
        "Changes checks in CSWorldConfigReader to a list of enumerations instead of strings.",
        "Adds \"str_checks\" as a transitional property to get a list of strings for the game's checks.",
        "Refines interactive mode's UI by forcing dark theme and adding up arrow support to insert the last command.",
        "Adds PATCHES.txt in patch builds.",
        "Adds a glitch effect when minigame player goes out of bounds.",
        "Overhauls main menu with new dynamic background and overlay.",
        "Introduces new MinigameLevel class for the Advanced Mode APIs that will eventually replace the old APIs.",
        "Updates templates to use new MinigameLevel class instead of get_level_information.",
        "Deprecates get_level_information in favor of MinigameLevel.",
        "Makes CSNadiaVMWriter more visible by subclassing it in the API as MinigameWriter.",
        "Replaces dialog at beginning of minigame with VN-style dialogue to introduce the plot.",
        "Deprecates the minigame classic mode editor."
    ],
    "v2.0.0-c4127f1": [
        "Redesigns first two minigame levels to introduce power on mechanics and navigation.",
        "Changes check \"player-collects-all\" to \"player-powers-all-devices\".",
        "Starts deprecating coin-related terminology in favor of \"devices\".",
        "Adds brand-new interface for basic mode that lets players interactively type commands to solve puzzles.",
        "Adds 'mg-classic-mode' argument to fallback to standard basic mode.",
        "Updates imagery in the minigame settings for new modes.",
        "Updates minigame settings to reflect new changes.",
        "Adds new NadiaVM command \"bind\" to make aliases of existing commands.",
        "Adds new NadiaVM command \"cast\" to make temporary, global variables.",
        "Resolves issues with the theming engine by replacing path.join with standard strings.",
        "Resolves an issue where story maps would try to initialize the readonly game type.",
        "Adds new decorative beanbag to minigame."
    ],
    "v2.0.0-e02dd5c": [
        "Updates icons on macOS to match macOS Big Sur's new icon design language.",
        "Replaces Masti sprite with new Mia sprite.",
        "Refreshes minigame tilemap with new environment based on story.",
        "Removes game type selection from Chapter 2 and makes game_type in the StoryMap object read-only.",
        "Changes objective in minigame from collecting coins to turning on computers.",
        "Changes build tools to use the beta icon when creating a build if configured to do so."
    ],
    "v2.0.0-f58e1cf": [
        "Introduces the Appearance tab in Settings to change the theme, dialogue font, size, and save screenshots.",
        "Adds additional theming support with Ayu themes for the game.",
        "Adds Merriweather and OpenDyslexic fonts.",
        "Changes Lexend font options to be bundled inside of the dialogue font option (Appearance > Dialogue font > Lexend...).",
        "Updates glossary with new terms: type foundry, virtual machine, kanban board.",
        "Rewrites parts of Chapter 6 to make apartment rent process and Meredith's introduction realistic and believable.",
        "Rewrites all major interactions with Christina to provide a more consistent personality type.",
        "Changes Zen'no's cat's name from Benny to Oliver.",
        "Modify parts of the story to make the player seem less of an idiot.",
        "Adds \"disable-minigame\" argument to argument parser to disable the minigame during playthroughs.",
        "Adds new icons for beta and canary builds while the game is running.",
        "Changes the text size of the chat history page.",
        "Changes AliceOS's window styles to match the game's theme.",
        "Sets default theme to \"Ayu Light Blue\" if none are initialized.",
        "Updates graphics definitions with new images.",
        "Adds id_eyes transition.",
        "Updates build settings to exclude DEVCHANGES.txt when on a stable build of the game."
    ],
    "v2.0.0-39c2532": [
        "Resolves an issue where the AliceOS desktop could be called infinitely on the call stack.",
        "Adds argument options via arguments.toml.",
        "Adds a glossary page in Help with terms and definitions.",
        "Adds use cases for inventory items in some parts of the game.",
        "Changes notification toast when an item is received to the game's default, not AliceOS's.",
        "Removes documented features in Help that don't exist.",
        "Includes Chapters 8 and 9, and introduces the Chapter 10 content for Christina's and Katorin's routes."
    ],
    "v1.2.4-db1": [
        "Resolves an issue where the AliceOS desktop could be called infinitely on the call stack.",
        "Adds argument options via arguments.toml.",
        "Adds a glossary page in Help with terms and definitions.",
        "Adds use cases for inventory items in some parts of the game.",
        "Changes notification toast when an item is received to the game's default, not AliceOS's.",
        "Removes documented features in Help that don't exist."
    ],
    "v1.2.3-db2": [
        "Makes AliceOS Desktop keybind ('d') universally available, not just the game menu or in the quick menu.",
        "Updates Fira to v1.3.1, which includes fixes for reporting proper list coordinates when calling as_list.",
        "Increases the font contrast on muted text colors in the game menu.",
        "Adds message bubble around NVL text in chat history.",
        "Renames \"Hub\" to \"Main Menu\", \"Chat\" to \"Chat History\", and \"Back\" to \"Back to Game\".",
        "Renames \"John Doe\" on empty saves to \"Foo Bar\" to be gender neutral.",
        "Removes \"entitlements.plist\" from Windows and Linux builds."
    ],
    "v1.2.3-db1": [
        "Resolves an issue where minigame levels with \"collect\" in Basic Mode fail due to incorrect VM code.",
        "Fixes a couple of minor typos, including pronoun conjugation agreement issues.",
        "Resolves an issue where attempting to view the license on a read-only file system fails (IOError).",
        "Adds more details about the different game modes and a preview image.",
        "Adds new \"Warp Speed\" option to minigame preview animation speeds.",
        "Adds options to show hidden NadiaVM commands and reduce spacing in VM preview window in Basic Mode.",
        "Adds an option to forcefully show the editor in Advanced Mode when an existing VM file is present.",
        "Improves minigame experience by rolling back to last checkpoint if an error occurs during the minigame.",
        "Prevents minigame overriding between modes by namespacing NadiaVM based on game mode.",
        "Adds keybinding 'l' to open the Unscripted log file (or select it in the file browser)."
    ],
    "v1.2.2-db1": [
        "Resolves an issue where the minigame preview would crash when calling for world coin list in basic mode.",
        "Resolves an issue where the advanced mode directory buttons crash on Windows.",
        "Resolves \"looking around\" repetition in the story.",
        "Resolves an issue in Chapter 7 where the ambient wave sounds didn't stop after the outlook scene.",
        "Fixes several typos in the story chapters.",
        "Changes story lines to better reflect the true nature of the story.",
        "Uses Python logging to log game events to (uvn.log)."
    ],
    "v1.2.0-db1": [
        "Bundles new coding minigame and settings to control how fast the animations should play",
        "Introduces the new Advanced Mode with official Python API support via Fira",
        "Adds additional chapters that were previously unavailable, including chapters that introduce Meredith (Fira) Sans",
        "Introduces a brand-new credits screen designed to be more developer-esque with Kotlin scripts",
        "Uses new Unscripted Core build system (build.toml) to configure features at build time",
        "Adds a brand-new profile creation screen when starting the game to select a name, preferred pronouns, and programming language",
        "Updates older chapters to respect preferred pronoun settings"
    ],
    "v1.0.0-rewrite1": [],
    "v1.0.0dev_beta4": []
}